nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSDHCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitSDHCPins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t port7_pin0_config = (/* Pin is configured as SDHC0_CLK */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-up function */
                                        IOPCTL_PIO_PULLUP_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 33ohm */
                                        IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN0 (coords: B22) is configured as SDHC0_CLK */
    IOPCTL_PinMuxSet(7U, 0U, port7_pin0_config);

    const uint32_t port7_pin1_config = (/* Pin is configured as SDHC0_CMD */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-up function */
                                        IOPCTL_PIO_PULLUP_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 33ohm */
                                        IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN1 (coords: B20) is configured as SDHC0_CMD */
    IOPCTL_PinMuxSet(7U, 1U, port7_pin1_config);

    const uint32_t SD_PWREN_B = (/* Pin is configured as PIO7_10 */
                                 IOPCTL_PIO_FUNC0 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Disable input buffer function */
                                 IOPCTL_PIO_INBUF_DI |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN10 (coords: A24) is configured as PIO7_10 */
    IOPCTL_PinMuxSet(BOARD_INITSDHCPINS_SD_PWREN_B_PORT, BOARD_INITSDHCPINS_SD_PWREN_B_PIN, SD_PWREN_B);

    const uint32_t SD_CARD_DET_N = (/* Pin is configured as PIO7_11 */
                                    IOPCTL_PIO_FUNC0 |
                                    /* Disable pull-up / pull-down function */
                                    IOPCTL_PIO_PUPD_DI |
                                    /* Enable pull-down function */
                                    IOPCTL_PIO_PULLDOWN_EN |
                                    /* Disable input buffer function */
                                    IOPCTL_PIO_INBUF_DI |
                                    /* Pseudo Output Drain is disabled */
                                    IOPCTL_PIO_PSEDRAIN_DI |
                                    /* Input function is not inverted */
                                    IOPCTL_PIO_INV_DI |
                                    /* Selects transmitter current drive 100ohm */
                                    IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN11 (coords: F18) is configured as PIO7_11 */
    IOPCTL_PinMuxSet(BOARD_INITSDHCPINS_SD_CARD_DET_N_PORT, BOARD_INITSDHCPINS_SD_CARD_DET_N_PIN, SD_CARD_DET_N);

    const uint32_t SD_VSELECT = (/* Pin is configured as PIO7_3 */
                                 IOPCTL_PIO_FUNC0 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Disable input buffer function */
                                 IOPCTL_PIO_INBUF_DI |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN3 (coords: C21) is configured as PIO7_3 */
    IOPCTL_PinMuxSet(BOARD_INITSDHCPINS_SD_VSELECT_PORT, BOARD_INITSDHCPINS_SD_VSELECT_PIN, SD_VSELECT);

    const uint32_t port7_pin6_config = (/* Pin is configured as SDHC0_DATA0 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-up function */
                                        IOPCTL_PIO_PULLUP_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 33ohm */
                                        IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN6 (coords: A22) is configured as SDHC0_DATA0 */
    IOPCTL_PinMuxSet(7U, 6U, port7_pin6_config);

    const uint32_t port7_pin7_config = (/* Pin is configured as SDHC0_DATA1 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Enable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_EN |
                                        /* Enable pull-up function */
                                        IOPCTL_PIO_PULLUP_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 33ohm */
                                        IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN7 (coords: A20) is configured as SDHC0_DATA1 */
    IOPCTL_PinMuxSet(7U, 7U, port7_pin7_config);

