nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitBUTTONsPins(void)
{

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t SW5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin V23)  */
    GPIO_PinInit(BOARD_INITBUTTONSPINS_SW5_GPIO, BOARD_INITBUTTONSPINS_SW5_PIN, &SW5_config);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t SW5 = (/* Pin is configured as PIO0_10 */
                          IOPCTL_PIO_FUNC0 |
                          /* Disable pull-up / pull-down function */
                          IOPCTL_PIO_PUPD_DI |
                          /* Enable pull-down function */
                          IOPCTL_PIO_PULLDOWN_EN |
                          /* Enables input buffer function */
                          IOPCTL_PIO_INBUF_EN |
                          /* Pseudo Output Drain is disabled */
                          IOPCTL_PIO_PSEDRAIN_DI |
                          /* Input function is not inverted */
                          IOPCTL_PIO_INV_DI |
                          /* Selects transmitter current drive 100ohm */
                          IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN10 (coords: V23) is configured as PIO0_10 */
    IOPCTL_PinMuxSet(BOARD_INITBUTTONSPINS_SW5_PORT, BOARD_INITBUTTONSPINS_SW5_PIN, SW5);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: AD23, peripheral: GPIO1, signal: 'GPIO, 13', pin_signal: PIO1_13/LP_FLEXCOMM2_P4/UTICK0_CAP1/CTIMER2_MAT3/SWD_TRACEDATA2/32KHZ_CLKOUT, direction: OUTPUT}
  - {pin_num: AB24, peripheral: GPIO0, signal: 'GPIO, 19', pin_signal: PIO0_19/LP_FLEXCOMM6_P2/SCT0_GPIN2/SCT0_OUT2/CTIMER2_MAT2/SAI1_RX_SYNC, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitLEDsPins(void)
{

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t LED_BLU_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin AB24)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED_BLU_GPIO, BOARD_INITLEDSPINS_LED_BLU_PIN, &LED_BLU_config);

    gpio_pin_config_t LED_GRN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_13 (pin AD23)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED_GRN_GPIO, BOARD_INITLEDSPINS_LED_GRN_PIN, &LED_GRN_config);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t LED_BLU = (/* Pin is configured as PIO0_19 */
                              IOPCTL_PIO_FUNC0 |
                              /* Disable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_DI |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Disable input buffer function */
                              IOPCTL_PIO_INBUF_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN19 (coords: AB24) is configured as PIO0_19 */
    IOPCTL_PinMuxSet(BOARD_INITLEDSPINS_LED_BLU_PORT, BOARD_INITLEDSPINS_LED_BLU_PIN, LED_BLU);

    const uint32_t LED_GRN = (/* Pin is configured as PIO1_13 */
                              IOPCTL_PIO_FUNC0 |
                              /* Disable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_DI |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Disable input buffer function */
                              IOPCTL_PIO_INBUF_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN13 (coords: AD23) is configured as PIO1_13 */
    IOPCTL_PinMuxSet(BOARD_INITLEDSPINS_LED_GRN_PORT, BOARD_INITLEDSPINS_LED_GRN_PIN, LED_GRN);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPI0Pins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: B2, peripheral: XSPI0, signal: SCLK0, pin_signal: PIO6_1/XSPI0_SCLK0/LP_FLEXCOMM10_P0, input_buffer: enable}
  - {pin_num: H6, peripheral: XSPI0, signal: SS0_N, pin_signal: PIO6_2/XSPI0_SS0_N/LP_FLEXCOMM10_P1, input_buffer: enable}
  - {pin_num: F6, peripheral: XSPI0, signal: 'DATA, 0', pin_signal: PIO6_3/XSPI0_DATA0/LP_FLEXCOMM10_P2, input_buffer: enable}
  - {pin_num: B3, peripheral: XSPI0, signal: 'DATA, 1', pin_signal: PIO6_4/XSPI0_DATA1/LP_FLEXCOMM10_P3, input_buffer: enable}
  - {pin_num: E8, peripheral: XSPI0, signal: 'DATA, 2', pin_signal: PIO6_5/XSPI0_DATA2/LP_FLEXCOMM10_P4, input_buffer: enable}
  - {pin_num: A4, peripheral: XSPI0, signal: 'DATA, 3', pin_signal: PIO6_6/XSPI0_DATA3/LP_FLEXCOMM10_P5, input_buffer: enable}
  - {pin_num: E6, peripheral: XSPI0, signal: DQS0, pin_signal: PIO6_7/XSPI0_DQS0/LP_FLEXCOMM10_P6, input_buffer: enable}
  - {pin_num: F5, peripheral: XSPI0, signal: 'DATA, 4', pin_signal: PIO6_8/XSPI0_DATA4/LP_FLEXCOMM13_P0/LP_FLEXCOMM11_P2, input_buffer: enable}
  - {pin_num: A2, peripheral: XSPI0, signal: 'DATA, 5', pin_signal: PIO6_9/XSPI0_DATA5/LP_FLEXCOMM13_P1/LP_FLEXCOMM11_P3, input_buffer: enable}
  - {pin_num: C4, peripheral: XSPI0, signal: 'DATA, 6', pin_signal: PIO6_10/XSPI0_DATA6/LP_FLEXCOMM13_P2/LP_FLEXCOMM11_P0, input_buffer: enable}
  - {pin_num: B4, peripheral: XSPI0, signal: 'DATA, 7', pin_signal: PIO6_11/XSPI0_DATA7/LP_FLEXCOMM13_P3/LP_FLEXCOMM11_P1, input_buffer: enable}
  - {pin_num: B1, peripheral: XSPI0, signal: SCLK0_N, pin_signal: PIO6_0/XSPI0_SCLK0_N/LP_FLEXCOMM7_P2, input_buffer: enable}
  - {pin_num: H5, peripheral: XSPI0, signal: SS1_N, pin_signal: PIO6_12/XSPI0_SS1_N, input_buffer: enable, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

