nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPI1Pins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: K4, peripheral: XSPI1, signal: SS0_N, pin_signal: PIO5_0/XSPI1_SS0_N/LP_FLEXCOMM13_P4}
  - {pin_num: F3, peripheral: XSPI1, signal: 'DATA, 0', pin_signal: PIO5_1/XSPI1_DATA0/LP_FLEXCOMM13_P5}
  - {pin_num: F2, peripheral: XSPI1, signal: 'DATA, 1', pin_signal: PIO5_2/XSPI1_DATA1/LP_FLEXCOMM13_P6}
  - {pin_num: H2, peripheral: XSPI1, signal: 'DATA, 2', pin_signal: PIO5_3/XSPI1_DATA2/LP_FLEXCOMM13_P0, input_buffer: enable}
  - {pin_num: J3, peripheral: XSPI1, signal: 'DATA, 3', pin_signal: PIO5_4/XSPI1_DATA3/LP_FLEXCOMM13_P1, input_buffer: enable}
  - {pin_num: G2, peripheral: XSPI1, signal: DQS0, pin_signal: PIO5_5/XSPI1_DQS0/LP_FLEXCOMM13_P2, input_buffer: enable}
  - {pin_num: E3, peripheral: XSPI1, signal: 'DATA, 4', pin_signal: PIO5_6/XSPI1_DATA4/LP_FLEXCOMM12_P3, input_buffer: enable}
  - {pin_num: F1, peripheral: XSPI1, signal: 'DATA, 5', pin_signal: PIO5_7/XSPI1_DATA5/LP_FLEXCOMM12_P0, input_buffer: enable}
  - {pin_num: H3, peripheral: XSPI1, signal: 'DATA, 6', pin_signal: PIO5_8/XSPI1_DATA6/LP_FLEXCOMM12_P1, input_buffer: enable}
  - {pin_num: H1, peripheral: XSPI1, signal: 'DATA, 7', pin_signal: PIO5_9/XSPI1_DATA7/LP_FLEXCOMM12_P2, input_buffer: enable}
  - {pin_num: K2, peripheral: XSPI1, signal: SCLK0, pin_signal: PIO5_10/XSPI1_SCLK0/LP_FLEXCOMM13_P3, input_buffer: enable}
  - {pin_num: K1, peripheral: XSPI1, signal: SS1_N, pin_signal: PIO5_11/XSPI1_SCLK0_N/LP_FLEXCOMM12_P4/XSPI1_SS1_N, input_buffer: enable}
  - {pin_num: K3, peripheral: XSPI1, signal: 'DATA, 8', pin_signal: PIO5_12/XSPI1_DATA8/LP_FLEXCOMM12_P5, input_buffer: enable, pull_enable: enable}
  - {pin_num: M3, peripheral: XSPI1, signal: 'DATA, 9', pin_signal: PIO5_13/XSPI1_DATA9/LP_FLEXCOMM12_P6, input_buffer: enable, pull_enable: enable}
  - {pin_num: L2, peripheral: XSPI1, signal: 'DATA, 10', pin_signal: PIO5_14/XSPI1_DATA10/LP_FLEXCOMM11_P0, input_buffer: enable, pull_enable: enable}
  - {pin_num: M1, peripheral: XSPI1, signal: 'DATA, 11', pin_signal: PIO5_15/XSPI1_DATA11/LP_FLEXCOMM11_P1, input_buffer: enable, pull_enable: enable}
  - {pin_num: M2, peripheral: XSPI1, signal: DQS1, pin_signal: PIO5_16/XSPI1_DQS1/LP_FLEXCOMM11_P2, input_buffer: enable}
  - {pin_num: P1, peripheral: XSPI1, signal: 'DATA, 12', pin_signal: PIO5_17/XSPI1_DATA12/LP_FLEXCOMM11_P3, input_buffer: enable, pull_enable: enable}
  - {pin_num: P2, peripheral: XSPI1, signal: 'DATA, 13', pin_signal: PIO5_18/XSPI1_DATA13/LP_FLEXCOMM11_P4, input_buffer: enable, pull_enable: enable}
  - {pin_num: N3, peripheral: XSPI1, signal: 'DATA, 14', pin_signal: PIO5_19/XSPI1_DATA14/LP_FLEXCOMM11_P5, input_buffer: enable, pull_enable: enable}
  - {pin_num: P3, peripheral: XSPI1, signal: 'DATA, 15', pin_signal: PIO5_20/XSPI1_DATA15/LP_FLEXCOMM11_P6, input_buffer: enable, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitXSPI1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitXSPI1Pins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t port5_pin0_config = (/* Pin is configured as XSPI1_PCS_A_0 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN0 (coords: K4) is configured as XSPI1_PCS_A_0 */
    IOPCTL_PinMuxSet(5U, 0U, port5_pin0_config);

    const uint32_t port5_pin1_config = (/* Pin is configured as XSPI1_DATA_A0 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN1 (coords: F3) is configured as XSPI1_DATA_A0 */
    IOPCTL_PinMuxSet(5U, 1U, port5_pin1_config);

    const uint32_t port5_pin10_config = (/* Pin is configured as XSPI1_SCK_A */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN10 (coords: K2) is configured as XSPI1_SCK_A */
    IOPCTL_PinMuxSet(5U, 10U, port5_pin10_config);

    const uint32_t port5_pin11_config = (/* Pin is configured as XSPI1_PCS_A_1 */
                                         IOPCTL_PIO_FUNC3 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN11 (coords: K1) is configured as XSPI1_PCS_A_1 */
    IOPCTL_PinMuxSet(5U, 11U, port5_pin11_config);

    const uint32_t port5_pin12_config = (/* Pin is configured as XSPI1_DATA_A8 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN12 (coords: K3) is configured as XSPI1_DATA_A8 */
    IOPCTL_PinMuxSet(5U, 12U, port5_pin12_config);

    const uint32_t port5_pin13_config = (/* Pin is configured as XSPI1_DATA_A9 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN13 (coords: M3) is configured as XSPI1_DATA_A9 */
    IOPCTL_PinMuxSet(5U, 13U, port5_pin13_config);

    const uint32_t port5_pin14_config = (/* Pin is configured as XSPI1_DATA_A10 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN14 (coords: L2) is configured as XSPI1_DATA_A10 */
    IOPCTL_PinMuxSet(5U, 14U, port5_pin14_config);

    const uint32_t port5_pin15_config = (/* Pin is configured as XSPI1_DATA_A11 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN15 (coords: M1) is configured as XSPI1_DATA_A11 */
    IOPCTL_PinMuxSet(5U, 15U, port5_pin15_config);

    const uint32_t port5_pin16_config = (/* Pin is configured as XSPI1_DQS_A_1 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN16 (coords: M2) is configured as XSPI1_DQS_A_1 */
    IOPCTL_PinMuxSet(5U, 16U, port5_pin16_config);

    const uint32_t port5_pin17_config = (/* Pin is configured as XSPI1_DATA_A12 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN17 (coords: P1) is configured as XSPI1_DATA_A12 */
    IOPCTL_PinMuxSet(5U, 17U, port5_pin17_config);

    const uint32_t port5_pin18_config = (/* Pin is configured as XSPI1_DATA_A13 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN18 (coords: P2) is configured as XSPI1_DATA_A13 */
    IOPCTL_PinMuxSet(5U, 18U, port5_pin18_config);

    const uint32_t port5_pin19_config = (/* Pin is configured as XSPI1_DATA_A14 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN19 (coords: N3) is configured as XSPI1_DATA_A14 */
    IOPCTL_PinMuxSet(5U, 19U, port5_pin19_config);

