nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.c
    const uint32_t port5_pin2_config = (/* Pin is configured as XSPI1_DATA_A1 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN2 (coords: F2) is configured as XSPI1_DATA_A1 */
    IOPCTL_PinMuxSet(5U, 2U, port5_pin2_config);

    const uint32_t port5_pin20_config = (/* Pin is configured as XSPI1_DATA_A15 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN20 (coords: P3) is configured as XSPI1_DATA_A15 */
    IOPCTL_PinMuxSet(5U, 20U, port5_pin20_config);

    const uint32_t port5_pin3_config = (/* Pin is configured as XSPI1_DATA_A2 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN3 (coords: H2) is configured as XSPI1_DATA_A2 */
    IOPCTL_PinMuxSet(5U, 3U, port5_pin3_config);

    const uint32_t port5_pin4_config = (/* Pin is configured as XSPI1_DATA_A3 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN4 (coords: J3) is configured as XSPI1_DATA_A3 */
    IOPCTL_PinMuxSet(5U, 4U, port5_pin4_config);

    const uint32_t port5_pin5_config = (/* Pin is configured as XSPI1_DQS_A_0 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN5 (coords: G2) is configured as XSPI1_DQS_A_0 */
    IOPCTL_PinMuxSet(5U, 5U, port5_pin5_config);

    const uint32_t port5_pin6_config = (/* Pin is configured as XSPI1_DATA_A4 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN6 (coords: E3) is configured as XSPI1_DATA_A4 */
    IOPCTL_PinMuxSet(5U, 6U, port5_pin6_config);

    const uint32_t port5_pin7_config = (/* Pin is configured as XSPI1_DATA_A5 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN7 (coords: F1) is configured as XSPI1_DATA_A5 */
    IOPCTL_PinMuxSet(5U, 7U, port5_pin7_config);

    const uint32_t port5_pin8_config = (/* Pin is configured as XSPI1_DATA_A6 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN8 (coords: H3) is configured as XSPI1_DATA_A6 */
    IOPCTL_PinMuxSet(5U, 8U, port5_pin8_config);

    const uint32_t port5_pin9_config = (/* Pin is configured as XSPI1_DATA_A7 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN9 (coords: H1) is configured as XSPI1_DATA_A7 */
    IOPCTL_PinMuxSet(5U, 9U, port5_pin9_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPI2Pins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D16, peripheral: XSPI2, signal: SS0_N, pin_signal: PIO4_0/XSPI2_SS0_N/LP_FLEXCOMM8_P0, input_buffer: enable}
  - {pin_num: B10, peripheral: XSPI2, signal: 'DATA, 0', pin_signal: PIO4_1/XSPI2_DATA0/LP_FLEXCOMM8_P1/LCD_D20, input_buffer: enable}
  - {pin_num: C10, peripheral: XSPI2, signal: 'DATA, 1', pin_signal: PIO4_2/XSPI2_DATA1/LP_FLEXCOMM8_P2/LCD_D21, input_buffer: enable}
  - {pin_num: B11, peripheral: XSPI2, signal: 'DATA, 2', pin_signal: PIO4_3/XSPI2_DATA2/LP_FLEXCOMM8_P3/LCD_D22, input_buffer: enable}
  - {pin_num: A10, peripheral: XSPI2, signal: 'DATA, 3', pin_signal: PIO4_4/XSPI2_DATA3/LP_FLEXCOMM8_P4/LCD_D23, input_buffer: enable}
  - {pin_num: A12, peripheral: XSPI2, signal: DQS0, pin_signal: PIO4_5/XSPI2_DQS0/LP_FLEXCOMM8_P5, input_buffer: enable}
  - {pin_num: C12, peripheral: XSPI2, signal: 'DATA, 4', pin_signal: PIO4_6/XSPI2_DATA4/LP_FLEXCOMM8_P6/LCD_D16, input_buffer: enable}
  - {pin_num: B12, peripheral: XSPI2, signal: 'DATA, 5', pin_signal: PIO4_7/XSPI2_DATA5/LP_FLEXCOMM9_P0/LCD_D17, input_buffer: enable}
  - {pin_num: C13, peripheral: XSPI2, signal: 'DATA, 6', pin_signal: PIO4_8/XSPI2_DATA6/LP_FLEXCOMM9_P1/LCD_D18, input_buffer: enable}
  - {pin_num: A14, peripheral: XSPI2, signal: 'DATA, 7', pin_signal: PIO4_9/XSPI2_DATA7/LP_FLEXCOMM9_P2/LCD_D19, input_buffer: enable}
  - {pin_num: B15, peripheral: XSPI2, signal: SCLK0, pin_signal: PIO4_10/XSPI2_SCLK0/LP_FLEXCOMM9_P3, input_buffer: enable}
  - {pin_num: C16, peripheral: XSPI2, signal: 'DATA, 8', pin_signal: PIO4_12/XSPI2_DATA8/LP_FLEXCOMM9_P5/LCD_DATA8/LCD_DBI_DATA8, input_buffer: enable}
  - {pin_num: C14, peripheral: XSPI2, signal: 'DATA, 9', pin_signal: PIO4_13/XSPI2_DATA9/LP_FLEXCOMM9_P6/LCD_D9/LCD_DBI_D9, input_buffer: enable}
  - {pin_num: A16, peripheral: XSPI2, signal: 'DATA, 10', pin_signal: PIO4_14/XSPI2_DATA10/LP_FLEXCOMM10_P0/LCD_D10/LCD_DBI_D10, input_buffer: enable}
  - {pin_num: B16, peripheral: XSPI2, signal: 'DATA, 11', pin_signal: PIO4_15/XSPI2_DATA11/LP_FLEXCOMM10_P1/LCD_D11/LCD_DBI_D11, input_buffer: enable}
  - {pin_num: C17, peripheral: XSPI2, signal: DQS1, pin_signal: PIO4_16/XSPI2_DQS1/LP_FLEXCOMM10_P2, input_buffer: enable}
  - {pin_num: A18, peripheral: XSPI2, signal: 'DATA, 12', pin_signal: PIO4_17/XSPI2_DATA12/LP_FLEXCOMM10_P3/LCD_D12/LCD_DBI_D12, input_buffer: enable}
  - {pin_num: B19, peripheral: XSPI2, signal: 'DATA, 13', pin_signal: PIO4_18/XSPI2_DATA13/LP_FLEXCOMM10_P4/LCD_D13/LCD_DBI_D13, input_buffer: enable}
  - {pin_num: B18, peripheral: XSPI2, signal: 'DATA, 14', pin_signal: PIO4_19/XSPI2_DATA14/LP_FLEXCOMM10_P5/LCD_D14/LCD_DBI_D14, input_buffer: enable}
  - {pin_num: C18, peripheral: XSPI2, signal: 'DATA, 15', pin_signal: PIO4_20/XSPI2_DATA15/LP_FLEXCOMM10_P6/LCD_D15/LCD_DBI_D15, input_buffer: enable}
  - {pin_num: B14, peripheral: XSPI2, signal: SCLK0_N, pin_signal: PIO4_11/XSPI2_SCLK0_N/LP_FLEXCOMM9_P4/XSPI2_SS1_N, input_buffer: enable, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

